---
kind: property
id: P:Autodesk.Revit.DB.GroupTypeId.RailingSystemSegmentPosts
source: html/bf8e02b0-f643-f63a-9798-b139107ec77f.htm
---
# Autodesk.Revit.DB.GroupTypeId.RailingSystemSegmentPosts Property

Posts.

## Syntax (C#)
```csharp
public static ForgeTypeId RailingSystemSegmentPosts { get; }
```